20251106T193702--kdoc-485-asepriteでパッキングする__wiki.org
:properties:
:ID: 20251106T193702
:end:
#+title:      KDOC 485: asepriteでパッキングする
#+date:       [2025-11-06 Thu 19:37]
#+filetags:   :wiki:
#+identifier: 20251106T193702

* この文書のステータス
- 作成
  - [X] 2025-11-10 貴島
- レビュー
  - [X] 2025-11-10 貴島

* 概要

2Dゲームでは小さな大量の画像を使う。それらを効率的に扱うためにはスプライトの管理が重要である。1ファイルに結合することで、ファイル読み込みを減らして高速化できる。

asepriteはゲーム用のピクセル画像やアニメーションを描くツールであるが、コマンドラインツールとしても使える。ディレクトリ内の画像をまとめて1つの画像にし、それらの対応関係をまとめたJSONを作ってくれるので、コードから読み込みやすくなる。

#+caption: tils以下のpngファイルをパッキングする。統合された1枚の画像ファイルとJSONができる
#+begin_src shell
aseprite \
    --batch ./tiles/*.png \
    --sheet ./dist/tiles.png \
    --data ./dist/tiles.json \
    --sheet-type packed \
    --format json-array \
    --filename-format "{title}"
#+end_src

#+caption: 生成JSON例。ファイル名とピクセルの対応関係が出力されている
#+begin_src json
{
  "frames": [
    {
      "filename": "tree",
      "frame": {
        "x": 32,
        "y": 64,
        "w": 32,
        "h": 32
      },
      "rotated": false,
      "trimmed": false,
      "spriteSourceSize": {
        "x": 0,
        "y": 0,
        "w": 32,
        "h": 32
      },
      "sourceSize": {
        "w": 32,
        "h": 32
      },
      "duration": 100
    },
    {
      "filename": "doctor",
      "frame": {
        "x": 32,
        "y": 128,
        "w": 32,
        "h": 32
      },
      "rotated": false,
      "trimmed": false,
      "spriteSourceSize": {
        "x": 0,
        "y": 0,
        "w": 32,
        "h": 32
      },
      "sourceSize": {
        "w": 32,
        "h": 32
      },
      "duration": 100
    }
  ]
}
#+end_src

* 関連
なし。
