20251106T193702--kdoc-485-asepriteでパッキングする__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:05:02Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 485: asepriteでパッキングする</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 485: asepriteでパッキングする</h1>
<div id="outline-container-org7df99ba" class="outline-2">
<h2 id="org7df99ba"><a href="#org7df99ba">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org7df99ba">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-11-10 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-11-10 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6d874ed" class="outline-2">
<h2 id="org6d874ed"><a href="#org6d874ed">概要</a></h2>
<div class="outline-text-2" id="text-org6d874ed">
<p>
2Dゲームでは小さな大量の画像を使う。それらを効率的に扱うためにはスプライトの管理が重要である。1ファイルに結合することで、ファイル読み込みを減らして高速化できる。
</p>

<p>
asepriteはゲーム用のピクセル画像やアニメーションを描くツールであるが、コマンドラインツールとしても使える。ディレクトリ内の画像をまとめて1つの画像にし、それらの対応関係をまとめたJSONを作ってくれるので、コードから読み込みやすくなる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>tils以下のpngファイルをパッキングする。統合された1枚の画像ファイルとJSONができる</label><pre class="src src-shell">aseprite <span class="org-sh-escaped-newline">\</span>
    --batch ./tiles/*.png <span class="org-sh-escaped-newline">\</span>
    --sheet ./dist/tiles.png <span class="org-sh-escaped-newline">\</span>
    --data ./dist/tiles.json <span class="org-sh-escaped-newline">\</span>
    --sheet-type packed <span class="org-sh-escaped-newline">\</span>
    --format json-array <span class="org-sh-escaped-newline">\</span>
    --filename-format <span class="org-string">"{title}"</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>生成JSON例。ファイル名とピクセルの対応関係が出力されている</label><pre class="src src-json">{
  "frames": [
    {
      "filename": "tree",
      "frame": {
        "x": 32,
        "y": 64,
        "w": 32,
        "h": 32
      },
      "rotated": false,
      "trimmed": false,
      "spriteSourceSize": {
        "x": 0,
        "y": 0,
        "w": 32,
        "h": 32
      },
      "sourceSize": {
        "w": 32,
        "h": 32
      },
      "duration": 100
    },
    {
      "filename": "doctor",
      "frame": {
        "x": 32,
        "y": 128,
        "w": 32,
        "h": 32
      },
      "rotated": false,
      "trimmed": false,
      "spriteSourceSize": {
        "x": 0,
        "y": 0,
        "w": 32,
        "h": 32
      },
      "sourceSize": {
        "w": 32,
        "h": 32
      },
      "duration": 100
    }
  ]
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc90697d" class="outline-2">
<h2 id="orgc90697d"><a href="#orgc90697d">関連</a></h2>
<div class="outline-text-2" id="text-orgc90697d">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
